{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "diagnostic_test_inquiry",
    "1": "cause_inquiry",
    "2": "medication_side_effects",
    "3": "symptom_inquiry",
    "4": "treatment_information",
    "5": "preventative_health",
    "6": "diet_nutrition_advice",
    "7": "prognosis_inquiry",
    "8": "find_specialist",
    "9": "clarification_request",
    "10": "definition_request",
    "11": "capability_inquiry",
    "12": "goodbye",
    "13": "greeting",
    "14": "first_aid_inquiry"
  },
  "initializer_range": 0.02,
  "label2id": {
    "capability_inquiry": 11,
    "cause_inquiry": 1,
    "clarification_request": 9,
    "definition_request": 10,
    "diagnostic_test_inquiry": 0,
    "diet_nutrition_advice": 6,
    "find_specialist": 8,
    "first_aid_inquiry": 14,
    "goodbye": 12,
    "greeting": 13,
    "medication_side_effects": 2,
    "preventative_health": 5,
    "prognosis_inquiry": 7,
    "symptom_inquiry": 3,
    "treatment_information": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.1",
  "vocab_size": 30522
}
